<HTML>
<HEAD>
<TITLE>
GPL
</TITLE>
<!-- Changed by: Bernhard Hailer, 26-Aug-1996 -->
</HEAD>

<BODY>
<P ALIGN=CENTER>
<FONT SIZE=+3>
 Die GNU General Public License<BR>
</FONT>
<FONT SIZE=+2>
 Version 2, June 1991<BR>
</FONT>
   Copyright (C) 1989, 1991 Free Software Foundation, Inc.<BR>
           675 Mass Ave, Cambridge, MA 02139, USA
</P>
</H1>

<HR>
<P>

<P ALIGN=CENTER>
<A HREF="gnulis_e.html">Englisches Original</A>
</P>

<HR>
<P>

Jeder ist dazu berechtigt, diese Lizenz zu kopieren und w&ouml;rtliche
Kopien von diesem Dokument zu verteilen, &Auml;nderungen sind jedoch nicht
erlaubt. Rechtsg&uuml;ltig ist das englischsprachige Original.
<P>

<HR>
<P>

<H2>VORWORT</H2>

Die Lizenzen für die meiste Software sind daraufhin ausgelegt, die
Weitergabe und die Möglichkeit der &Auml;nderung zu verhindern.
Im Gegensatz dazu will die GNU General Public License (im folgenden mit
"`GPL"' bezeichnet) sicherstellen,
da&szlig; freie Software von jedem benutzt und ver&auml;ndert werden kann - um
sicherzustellen, da&szlig; die Software f&uuml;r alle Benutzer frei ist. Diese
GPL gilt f&uuml;r den gr&ouml;&szlig;ten Teil der Software von der 
Free Software Foundation und f&uuml;r alle anderen Programme, deren Autoren
ihre Arbeit unter die GPL gestellt haben (einige andere Programm der
Free Software Foundation unterliegen stattdessen der GNU Library General
Public License). Auch Sie k&ouml;nnen Ihre Programme unter diese License
stellen.
<P>

Wenn wir von freier Software sprechen, meinen wir Freiheit, nicht Preis.
Unsere General Public Licenses haben den Zweck, sicherzustellen, da&szlig; 
Sie die Freiheit haben, Kopien freier Software zu verbreiten (und etwas
f&uuml;r diesen Service zu berechnen, wenn Sie wollen), da&szlig; Sie den 
Quellcode erhalten oder bekommen k&ouml;nnen, wenn Sie wollen, und da&szlig; 
Sie die Software &auml;ndern oder Teile davon in neuen freien Programmen 
verwenden k&ouml;nnen; weiterhin haben die Licences den Sinn, Sie dar&uuml;ber 
zu unterrichten, da&szlig; Sie dies alles tun d&uuml;rfen.
<P>

Um Ihre Rechte zu sch&uuml;tzen, m&uuml;ssen wir Einschr&auml;nkungen machen, 
die es jedem verbieten, Ihnen diese Rechte zu verweigern oder Sie aufzufordern,
auf diese Rechte zu verzichten. Aus diesen Einschr&auml;nkungen folgen
bestimmte Verantwortlichkeiten f&uuml;r Sie, wenn Sie Kopien der Software
verbreiten oder sie ver&auml;ndern.
<P>

Wenn Sie zum Beispiel Kopien eines solchen Programmes verbreiten, ob umsonst
oder gegen Bezahlung, so m&uuml;ssen Sie den Empf&auml;ngern alle Rechte 
gew&auml;hren, die Sie selbst haben. Sie m&uuml;ssen sicherstellen, da&szlig; 
auch sie den Quellcode erhalten oder erhalten k&ouml;nnen. Und Sie m&uuml;ssen 
ihnen diese Bedingungen zeigen, damit sie ihre Rechte kennen.
<P>

Wir sch&uuml;tzen Ihre Rechte in zwei Schritten: (1) wir stellen die Software
unter ein Copyright und (2) wir bieten Ihnen diese Lizenz an, die Ihnen
die rechtliche Erlaubnis gibt, die Software zu kopieren, zu verbreiten
und/oder zu modifizieren.
<P>

Um den Autor und uns selbst zu sch&uuml;tzen, m&ouml;chten wir sicherstellen, 
da&szlig; jeder versteht, da&szlig; es keine Garantie f&uuml;r diese freie 
Software gibt. Wenn die Software von jemand anderem modifiziert und 
weitergegeben wird, m&ouml;chten wir, da&szlig; die Empf&auml;nger wissen, 
da&szlig; sie nicht das Original erhalten haben, damit Probleme, die von 
anderen hervorgerufen wurden, nicht die Reputation des urspr&uuml;nglichen 
Autors sch&auml;digen.
<P>

Schlie&szlig;lich ist jedes freie Programm durch Software-Patente bedroht. Wir
m&ouml;chten die Gefahr ausschlie&szlig;en, da&szlig; Distributoren eines 
freien Programmes individuelle Patente erhalten mit dem Effekt, da&szlig; das 
Programm propriet&auml;r wird. Um dies zu verhindern, haben wir klar gemacht, 
da&szlig; jedes Patent die freie Benutzung von jedem erlaubt oder gar nicht 
lizenziert werden darf.
<P>

Die pr&auml;zisen Begriffe und Bedingungen f&uuml;r das Kopieren, 
Verteilen und Modifizieren folgen:

<H2>GNU GENERAL PUBLIC LICENSE</H2>

<H3>Begriffe und Bedingungen f&uuml;r das Kopieren, Verteilen und 
    Modifizieren</H3>

<B>0.</B> 
Diese Lizenz gilt f&uuml;r jedes Programm oder jede andere Arbeit, die einen
Vermerk des Copyright-Inhabers enth&auml;lt, der besagt, da&szlig; die Arbeit 
unter den Bestimmungen dieser General Public License verbreitet werden darf. 
Der Begriff "`Programm"' steht im folgenden f&uuml;r jedes derartige Programm 
und f&uuml;r jede derartige Arbeit und der Begriff "`auf dem Programm 
basierende Arbeit"' meint entweder das Programm oder jegliche abgeleitete 
Arbeit im Sinne der Copyright-Gesetze: Das bedeutet eine Arbeit, die das 
Programm oder einen Teil dessen enth&auml;lt, entweder w&ouml;rtlich oder mit 
Modifikationen und/oder &uuml;bersetzt in eine andere Sprache. (Im folgenden 
wird die &Uuml;bersetzung ohne Einschr&auml;nkung als "`Modifikation"' 
verstanden). Jeder Lizenznehmer wird im folgenden als "`Sie"' angesprochen.
<P>

Andere Aktivit&auml;ten als Kopieren, Verteilen und Modifizieren werden nicht
von dieser Lizenz abgedeckt; sie sind au&szlig;erhalb ihres 
G&uuml;ltigkeitsbereichs. Der Vorgang des Ablaufenlassens des Programmes ist 
nicht beschr&auml;nkt, und die Ausgabe des Programmes unterliegt dieser Lizenz 
nur, wenn der Inhalt eine auf dem Programm basierende Arbeit darstellt 
(unabh&auml;ngig davon, da&szlig; die Ausgabe durch ein Laufenlassen des 
Programmes erfolgte). Ob dies zutrifft, h&auml;ngt davon ab, was das Programm 
tut.
<P>

<B>1.</B> 
Sie d&uuml;rfen w&ouml;rtliche Kopien vom Quellcode des Programms anfertigen 
und verbreiten, so wie Sie ihn erhalten haben, auf jedem Medium, vorausgesetzt,
da&szlig; Sie mit jeder Kopie einen entsprechenden Copyright-Vermerk sowie
einen Haftungsausschluss ver&ouml;ffentlichen; lassen Sie alle Vermerke, die
sich auf diese Lizenz beziehen, intakt, sowie alle Vermerke, die auf die
nicht vorhandene Garantie hinweisen; geben Sie weiterhin allen Empf&auml;ngern
des Programmes eine Kopie dieser Lizenz zusammen mit dem Programm.
<P>

Sie d&uuml;rfen f&uuml;r den eigentlichen Kopiervorgang eine Geb&uuml;hr 
verlangen und Sie d&uuml;rfen auf Ihren Wunsch eine Garantie f&uuml;r das 
Programm gegen Entgelt anbieten.
<P>

<B>2.</B> 
Sie d&uuml;rfen Ihre Kopie des Programmes oder eines Teils davon modifizieren,
wodurch eine auf dem Programm basierende Arbeit entsteht; Sie d&uuml;rfen
derartige Modifikationen unter den Bestimmungen von Abschnitt 1 kopieren
und verbreiten, vorausgesetzt, da&szlig; zus&auml;tzlich alle folgenden 
Bedingungen erf&uuml;llt werden:

<BLOCKQUOTE>
<B>a)</B> 
     Sie m&uuml;ssen daf&uuml;r Sorge tragen, da&szlig; die ver&auml;nderten 
     Dateien einen auff&auml;lligen Vermerk tragen, da&szlig; sie von Ihnen 
     ver&auml;ndert wurden, sowie das Datum jeder &Auml;nderung.
<P>
<B>b)</B>
      Sie m&uuml;ssen daf&uuml;r sorgen, da&szlig; jede Arbeit, die Sie 
     verbreiten oder ver&ouml;ffentlichen, und die ganz oder in Teilen von 
     einem Programm oder Teilen davon abgeleitet ist, Dritten gegen&uuml;ber 
     als ganzes unter den Bedingungen dieser Lizenz ohne Lizenzgeb&uuml;hren 
     zur Verf&uuml;gung gestellt wird.
<P>
<B>c)</B> Wenn das modifizierte Programm normalerweise beim Lauf interaktiv
     Kommandos einliest, m&uuml;ssen Sie daf&uuml;r sorgen, da&szlig; es, wenn 
     es auf gew&ouml;hnlichem Wege f&uuml;r solch eine interaktive Nutzung 
     gestartet wird, eine Meldung ausgibt oder ausdruckt, die einen geeigneten
     Copyright-Vermerk enth&auml;lt sowie einen Hinweis, da&szlig; es keine
     Gew&auml;hrleistung gibt (oder da&szlig; Sie Garantie leisten), und 
     da&szlig; Benutzer das Programm unter diesen Bedingungen weiter verbreiten
     d&uuml;rfen; der Benutzer mu&szlig; auch darauf hingewiesen werden, wie er
     eine Kopie dieser Lizenz lesen kann. (Ausnahme: Wenn das Programm
     selbst interaktiv arbeitet, aber normalerweise keine derartige
     Meldung ausgibt, mu&szlig; Ihre auf dem Programm basierende Arbeit auch
     keine solche Meldung ausgeben).
</BLOCKQUOTE>

Diese Anforderungen betreffen die modifizierte Arbeit als ganzes. Wenn
identifizierbare Abschnitte der Arbeit nicht von dem Programm abgeleitet
sind und vern&uuml;nftigerweise selbst als unabh&auml;ngige und 
eigenst&auml;ndige Arbeiten betrachtet werden k&ouml;nnen, dann erstrecken 
sich diese Lizenz und ihre Begriffe nicht auf diese Abschnitte, wenn sie als 
eigenst&auml;ndige Arbeiten verbreitet werden. Wenn Sie jedoch die selben 
Abschnitte als Teil eines Ganzen verteilen, das eine auf dem Programm 
basierende Arbeit ist, dann mu&szlig; die Verteilung des Ganzen nach den 
Bedingungen dieser Lizenz erfolgen, wobei die Rechte weiterer Lizenznehmer auf 
das gesamte Programm ausgedehnt werden, und damit auf jeden Teil des Ganzen, 
unabh&auml;ngig davon, wer diesen Teil geschrieben hat.
<P>

Somit ist es nicht die Absicht dieses Abschnittes, Rechte f&uuml;r Arbeiten
in Anspruch zu nehmen oder zu beschneiden, die komplett von Ihnen geschrieben
wurden; stattdessen ist es die Absicht, die Rechte zur Kontrolle der
Verteilung von Arbeiten, die auf anderen Programmen oder einer Zusammenstellung
basieren, auszu&uuml;ben.
<P>

Weiterhin f&uuml;hrt ein einfaches Zusammenstellen einer anderen Arbeit, die 
nicht auf dem Programm basiert, zusammen mit dem Programm oder einer auf dem
Programm basierenden Arbeit auf einem Speicher- oder Verteilmedium nicht
dazu, da&szlig; die andere Arbeit den Regeln dieser Lizenz unterliegt.
<P>

<B>3.</B> Sie d&uuml;rfen das Programm (oder eine darauf basierende Arbeit wie 
in Abschnitt 2) als object code oder in ausf&uuml;hrbarer Form unter den Bedingungen von Abschnitt 1 und 2 kopieren und verteilen, vorausgesetzt, da&szlig; 
Sie eines der folgenden Dinge tun:

<BLOCKQUOTE>
<B>a)</B> Liefern Sie zus&auml;tzlich den kompletten zugeh&ouml;rigen 
     maschinenlesbaren Quellcode auf einem Medium, das &uuml;blicherweise 
     f&uuml;r den Datenaustausch verwendet wird, wobei die Verteilung unter 
     den Bedingungen der Abschnitte 1 und 2 erfolgen mu&szlig;; oder
<P>
<B>b)</B> Liefern Sie das Programm mit einem schriftlichen Angebot, das 
     mindestens drei Jahre lang g&uuml;ltig sein mu&szlig;, da&szlig; Sie 
     jedem Dritten eine komplette maschinenlesbare Kopie des Quellcodes zur 
     Verf&uuml;gung stellen, wobei keine weiteren Kosten als f&uuml;r den 
     physikalischen Kopiervorgang anfallen d&uuml;rfen und der Quellcode unter 
     den Bedingungen der Abschnitte 1 und 2 auf einem Medium verteilt wird, 
     das &uuml;blicherweise f&uuml;r den Datenaustausch verwendet wird; oder
<P>
<B>c)</B> Liefern Sie das Programm mit der Information, die Sie erhalten haben,
     da&szlig; der korrespondierende Quellcode angeboten ist. (Diese 
     Alternative gilt nur f&uuml;r nicht-kommerzielle Zwecke und nur, wenn Sie 
     das Programm als object code oder in ausf&uuml;hrbarer Form mit einem 
     entsprechenden Angebot erhalten haben, in Einklang mit Unterabschnitt b 
     oben).
</BLOCKQUOTE>

Der "Quellcode einer Arbeit" ist die Form der Arbeit, die vorzugsweise
verwendet wird, um Modifikationen durchzuf&uuml;hren. F&uuml;r ein 
ausf&uuml;hrbares Programm bedeutet der Quellcode: Der Quellcode aller Module, 
die das Programm beinhaltet, zus&auml;tzlich alle zugeh&ouml;rigen 
Schnittstellen-Definitions-Dateien, sowie die Scripten, die die Kompilierung 
sowie die Installation des ausf&uuml;hrbaren Programmes kontrollieren. Als 
spezielle Ausnahme jedoch mu&szlig; der verteilte Quellcode nichts enthalten, 
was normalerweise (entweder als Quellcode oder in bin&auml;rer Form) mit den 
Hauptkomponenten des Betriebssystems (Kernel, Compiler usw.) verteilt wird, 
unter dem das Programm l&auml;uft, au&szlig;er diese Komponente selbst 
begleitet das ausf&uuml;hrbare Programm.
<P>

Wenn die Verteilung eines ausf&uuml;hrbaren Programmes oder des object codes
dadurch erfolgt, da&szlig; eine Stelle zur Verf&uuml;gung gestellt wird, von 
der kopiert werden kann, so gilt das zur Verf&uuml;gung stellen einer 
&auml;quivalenten Stelle zum Kopieren des Quellcodes als Verteilen des 
Quellcodes, selbst wenn Dritte nicht dazu gezwungen sind, die Quellen zusammen 
mit dem object code zu kopieren.
<P>

<B>4.</B> 
Sie d&uuml;rfen das Programm nicht kopieren, modifizieren, lizenzieren oder
verbreiten au&szlig;er ausdr&uuml;cklich unter dieser Lizenz. Jeder 
anderweitige Versuch, das Programm zu kopieren, modifizieren, lizenzieren oder 
zu verbreiten ist nichtig und beendet automatisch Ihre Rechte unter dieser
Lizenz. Jedoch werden die Lizenzen Dritter, die von Ihnen Kopien oder Rechte 
unter dieser Lizenz erhalten haben, nicht beendet, solange diese die Lizenz 
voll anerkennen und befolgen.
<P>

<B>5.</B> 
Sie sind nicht verpflichtet, diese Lizenz anzunehmen, da Sie sie nicht
unterzeichnet haben. Jedoch gibt Ihnen nichts anderes die Erlaubnis, das
Programm oder von ihm abgeleitete Arbeiten zu modifizieren oder zu verbreiten. 
Diese Handlungen sind gesetzlich verboten, wenn Sie diese Lizenz nicht 
anerkennen. Wenn Sie also das Programm (oder eine darauf basierende Arbeit) 
modifizieren oder verbreiten, erkl&auml;ren Sie damit Ihr Einverst&auml;ndnis 
mit dieser Lizenz und allen ihren Begriffen und Bedingungen zum Kopieren, 
Verbreiten und Modifizieren des Programms oder einer darauf basierenden Arbeit.
<P>

<B>6.</B> 
Jedes Mal, wenn Sie das Programm (oder eine auf dem Programm basierende
Arbeit) weitergeben, erh&auml;lt der Empf&auml;nger automatisch vom originalen
Lizenzgeber die Lizenz, das Programm gem&auml;&szlig; dieser Begriffe und
Bestimmungen zu kopieren, zu verbreiten und zu modifizieren. Sie d&uuml;rfen
keine weiteren Einschr&auml;nkungen der Durchsetzung der hierin zugestandenen
Rechte des Empf&auml;ngers vornehmen. Sie sind nicht daf&uuml;r verantwortlich,
Dritte zur Anerkennung dieser Lizenz zu bewegen.
<P>

<B>7.</B> 
Wenn aufgrund eines Gerichtsurteils oder wegen patentrechtlicher
Schwierigkeiten oder aus irgendwelchen anderen Gr&uuml;nden Umst&auml;nde 
auftreten (ob durch Gerichtsbeschlu&szlig;, Vergleich oder amderweitig), die 
den Bestimmungen in dieser Lizenz entgegensprechen, so befreien Sie diese
Umst&auml;nde nicht von den Bestimmungen in dieser Lizenz. Wenn Sie das 
Programm nicht unter gleichzeitiger Beachtung der Bedingungen in dieser Lizenz
und Ihrer anderweitigen Verpflichtungen verbreiten k&ouml;nnen, dann 
k&ouml;nnen Sie als Folge das Programm &uuml;berhaupt nicht verbreiten. Wenn 
zum Beispiel ein Patent nicht die geb&uuml;hrenfreie Weiterverbreitung des 
Programmes durch diejenigen erlaubt, die das Programm direkt oder indirekt von 
Ihnen erhalten haben, dann besteht der einzige Weg, das Patent und diese 
Lizenz zu befolgen, darin, ganz auf die Verbreitung des Programmes zu 
verzichten.
<P>

Wenn irgendein Teil dieses Abschnittes f&uuml;r ung&uuml;ltig oder unter 
irgendwelchen bestimmten Umst&auml;nden f&uuml;r undurchsetzbar gehalten wird, 
soll die Grundaussage dieses Abschnittes gelten; der ganze Abschnitt soll 
unter den &uuml;brigen Umst&auml;nden G&uuml;ltigkeit haben.
<P>

Es ist nicht der Zweck dieses Abschnittes, Sie dazu zu bringen, irgendwelche
Patente oder andere Rechtsg&uuml;ter anzufechten oder die G&uuml;ltigkeit 
irgendwelcher solcher G&uuml;ter zu bestreiten; dieser Abschnitt hat den 
einzigen Zweck, die Integrit&auml;t des Verbreitungssystems der freien 
Software zu sch&uuml;tzen, das durch praktizierte &ouml;ffentliche Lizenzen 
verwirklicht wird. Viele Leute haben gro&szlig;z&uuml;gige Beitr&auml;ge zum 
weiten Bereich der mit diesem System verbreiteten Software gemacht im 
Vertrauen auf die konsistente Anwendung dieses Systems; es liegt am 
Autor/Geber zu entscheiden, ob er die Software mittels irgendeines anderen 
Systems verbreiten will und ein Lizenznehmer hat auf diese Entscheidung
keinen Einflu&szlig;.
<P>

Dieser Abschnitt ist dazu gedacht, klar zu machen, was als Konsequenz aus
dem Rest dieser Lizenz betrachtet wird.
<P>

<B>8.</B> 
Wenn die Verbreitung und/oder die Benutzung des Programmes in bestimmten
Staaten entweder durch Patente oder durch Copyright-gesch&uuml;tzte 
Schnittstellen eingeschr&auml;nkt ist, kann der originale Copyright-Inhaber, 
der das Programm unter diese Lizenz gestellt hat, eine explizite geographische 
Begrenzung der Verbreitung angeben, indem diese Staaten ausgeschlossen werden, 
so da&szlig; die Verbreitung nur in und unter den Staaten erlaubt ist, die 
nicht ausgeschlossen sind. In einem solchen Fall beinhaltet diese Lizenz die 
Beschr&auml;nkung, als w&auml;re sie in diesem Text niedergeschrieben.
<P>

<B>9.</B> 
Die Free Software Foundation kann von Zeit zu Zeit &uuml;berarbeitete und/oder
neue Versionen der General Public License ver&ouml;ffentlichen. Solche neuen
Versionen werden vom Geist her der gegenw&auml;rtigen entsprechen, k&ouml;nnen 
aber im Detail abweichen, um neuen Problemen und Anforderungen gerecht zu 
werden.
<P>

Jede Version hat eine eindeutig unterscheidbare Versionsnummer. Wenn das
Programm angibt, welche Version auf es zutrifft und "any later version", so
haben Sie die Wahl, entweder den Begriffen und Bedingungen dieser Version
zu folgen oder denen jeder beliebigen sp&auml;teren Version, die von der
Free Software Foundation ver&ouml;ffentlicht wurde. Wenn das Programm keine
Versionsnummer angibt, k&ouml;nnen Sie eine beliebige Version w&auml;hlen, die 
je von der Free Software Foundation ver&ouml;ffentlicht wurde.
<P>

<B>10.</B> 
Wenn Sie den Wunsch haben, Teile des Programmes in anderen freien Programmen 
zu verwenden, deren Bedingungen f&uuml;r das Verbreiten anders sind, schreiben 
Sie an den Autor, um ihn um die Erlaubnis zu bitten. F&uuml;r Software, die 
unter dem Copyright der Free Software Foundation steht, schreiben Sie an die 
Free Software Foundation; wir machen zu diesem Zweck manchmal Ausnahmen. 
Unsere Entscheidung wird von folgenden zwei Zielen geleitet: Dem Erhalten des 
freien Status von allen abgeleiteten Arbeiten unserer freien Software und der 
F&ouml;rderung der Verbreitung und Nutzung von Software generell.


<H2>KEINE GEW&Auml;HRLEISTUNG</H2>

<B>
11. Da das Programm ohne jegliche Kosten lizenziert wird, besteht keinerlei
Gew&auml;hrleistung f&uuml;r das Programm bis zu dem Ma&szlig;, wie es durch 
geltende Gesetze zugestanden wird. Au&szlig;er wenn anderweitig schriftlich 
best&auml;tigt, stellen die Copyright-Inhaber und/oder Dritte das Programm so 
zur Verf&uuml;gung, "wie es ist", ohne irgendeine Gew&auml;hrleistung, weder 
ausdr&uuml;cklich noch implizit, einschlie&szlig;lich, aber nicht begrenzt 
auf, die Tauglichkeit und Verwendbarkeit f&uuml;r einen bestimmten Zweck. Das 
volle Risiko bez&uuml;glich Qualit&auml;t und Leistungsf&auml;higkeit des 
Programmes liegt bei Ihnen. Sollte das Programm fehlerhaft sein, 
&uuml;bernehmen Sie die Kosten f&uuml;r notwendigen Service, Reparatur oder 
Korrektur.
<P>

12. In keinem Fall, au&szlig;er durch geltendes Recht gefordert oder 
schriftlich zugesichert, ist irgendein Copyright-Inhaber oder irgendein 
Dritter, der das Programm wie oben erlaubt modifiziert oder verbreitet hat, 
Ihnen gegen&uuml;ber f&uuml;r irgendwelche Sch&auml;den haftbar, 
einschlie&szlig;lich jeglicher genereller, spezieller, zuf&auml;lliger oder 
Folgesch&auml;den, die aus der Benutzung des Programmes oder der 
Unbenutzbarkeit des Programmes folgen (einschlie&szlig;lich, aber nicht 
beschr&auml;nkt auf, Datenverluste, fehlerhafte Verarbeitung von Daten, 
Verluste, die von Ihnen oder anderen getragen werden m&uuml;ssen, oder einen 
Fehler des Programms, mit irgeneinem anderen Programm zusammenzuarbeiten),
selbst wenn ein Copyright-Inhaber oder Dritter &uuml;ber die M&ouml;glichkeit 
solcher Sch&auml;den unterrichtet worden war.

<P ALIGN=CENTER>
ENDE DER BEGRIFFE UND BESTIMMUNGEN
</P>

</B>
<P>

<HR>
<P>

<H2>Anhang: Wie wenden Sie diese Begriffe auf Ihre neuen Programme an</H2>

Wenn Sie ein neues Programm entwickeln und wollen, da&szlig; es f&uuml;r 
gr&ouml;&szlig;tm&ouml;glichen Nutzen f&uuml;r die Allgemeinheit ist, dann ist 
der beste Weg, dies zu erreichen, es zu freier Software zu machen, die jeder 
unter diesen Bestimmungen weiterverbreiten und ver&auml;ndern kann.
<P>

Um dies zu erreichen, f&uuml;gen Sie die folgenden Anmerkungen zu Ihrem 
Programm hinzu. Es ist am sichersten, sie an den Anfang einer jeden Quelldatei 
zu stellen, um den Gew&auml;hrleistungsausschlu&szlig; m&ouml;glichst deutlich 
darzustellen; au&szlig;erdem sollte jede Datei mindestens eine 
"Copyright"-Zeile besitzen sowie einen kurzen Hinweis darauf, wo die 
vollst&auml;ndige Lizenz gefunden werden kann.

<PRE>
    <I>eine Zeile mit dem Programmnamen und einer kurzen Beschreibung </I>
    Copyright (C) 19<I>yy                             Name des Autors</I>


    This program is free software; you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation; either version 2 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program; if not, write to the Free Software
    Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
</PRE>

F&uuml;gen Sie auch eine kurze Notiz hinzu, wie Sie postalisch (normal und per
Email) erreichbar sind.
<P>

Wenn Ihr Programm interaktiv ist, sorgen Sie daf&uuml;r, da&szlig; es nach dem 
Start einen kurzen Vermerk ausgibt:

<PRE>
    Gnomovision version 69, Copyright (C) 19<I>yy Name des Autors</I>
    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.
    This is free software, and you are welcome to redistribute it
    under certain conditions; type `show c' for details.
</PRE>

Die hypothetischen Kommandos `show w' und `show c' sollten die entsprechenden
Teile der GPL anzeigen. Nat&uuml;rlich k&ouml;nnen die von Ihnen verwendeten 
Kommandos anders hei&szlig;en als `show w' und `show c'; es k&ouml;nnten auch 
einfach Mausklicks sein - was immer am besten in Ihr Programm pa&szlig;t.
<P>

Wenn n&ouml;tig, sollten Sie auch Ihren Arbeitgeber (wenn Sie als Programmierer
arbeiten) oder Ihre Schule dazu bringen, einen Copyright-Verzicht f&uuml;r das
Programm zu unterschreiben. Hier ist ein Beispiel mit ge&auml;nderten Namen:

<PRE>
  Yoyodyne, Inc., hereby disclaims all copyright interest in the program
  `Gnomovision' (which makes passes at compilers) written by James Hacker.

  <I>Unterschrift von Ty Coon</I>, 1 April 1989
  Ty Coon, Vizepr&auml;sident
</PRE>

Diese General Public License erlaubt es nicht, das Programm in propriet&auml;re
Programme einzubinden. Wenn Ihr Programm eine Bibliotheksfunktion ist, kann
es sinnvoller sein, das Binden propriet&auml;rer Programme mit dieser 
Bibliothek zu gestatten. Wenn Sie dies tun wollen, sollten Sie die GNU Library 
General Public License anstelle dieser Lizenz verwenden.
<P>

<HR>
<ADDRESS>
Copyright (C) 1989, 1991 Free Software Foundation, Inc.<BR>
675 Mass Ave, Cambridge, MA 02139, USA<BR>
In HTML gewandelt 04-Aug-96 BeH
</ADDRESS>

</BODY>
</HTML>

